%% Weyl-Heisenberg Bases Toolbox
% Function "weylhzg.m"
%% Îïèñàíèå:
% Ôóíêöèÿ ôîğìèğîâàíèÿ ìàòğèöû áàçèñà Âåéëÿ-Ãåéçåíáåğãà ñ èñïîëüçîâàíèåì
% ïğîöåññà Ãğàìà-Øìèäòà.
%
%% Âõîäíûå äàííûå:
% M - êîëè÷åñòâî ñäâèãîâ ïî ÷àñòîòå,
% L - êîëè÷åñòâî ñäâèãîâ ïî âğåìåíè,
% a - ïàğàìåòğ áàçèñà,
% sigma - ñğåäíåêâàäğàòè÷åñêîå îòêëîíåíèå.
%
%% Âûõîäíûå äàííûå:
% W - ìàòğèöà îïòèìàëüíîãî áàçèñà Âåéëÿ-Ãåéçåíáåğãà [N, 2N].
function [ W ] = weylhzg( M, L, a, sigma )

% Ï.1 Ôîğìèğîâàíèå ğñøèğåííîé âåùåñòâåííîé ìàòğèöû Ãàáîğà: Gb = |ReG|
%                                                               |ImG| => [2N, 2N]
N  = M * L; % ×èñëî äèñêğåòíûõ îòñ÷åòîâ.
N2 = N * 2; % Óäâîåííîå ÷èñëî äèñêğåòíûõ îòñ÷åòîâ.
Gb = gaborreal(M, L, a, sigma);

% Ï.2 Îğòîãîíàëèçàöèÿ ïî Ãğàìà-Øìèäòó:
Vopt = gschmidt(Gb);

% Ï.3 Áëî÷íîå ğàçáèåíèå ìàòğèöû íà äâå: Vîïò = |V1îïò| => [N, 2N]
%                                              |V2îïò| => [N, 2N]
V1 = Vopt(  1: N,:);
V2 = Vopt(N+1:N2,:);
 
% Ï.4 Ïîñòğîåíèå ìàòğèöû îïòèìàëüíîãî áàçèñà Âåéëÿ-Ãåéçåíáåğãà:
% Uîïò = V1îïò + j * V2îïò =>[N, 2N]
W = V1 + 1i * V2;
end